In [5]:
import pandas as pd
import numpy as np

In [6]:
import pyodbc

In [7]:
data = pd.read_csv("Incubyte2.csv")

# Importing Data

In [92]:
import numpy as np
data.fillna(0)

,Customer_Name,Customer_ID,Customer_Open_Date,Last_Consulted_Date,Vaccination_Type,Doctor_Consulted,State,Country,Postcode,FLAG
0,Alex,123457,20101012,20121013,MVD,Paul,SA,USA,121002,A
1,John,123458,20101012,20121013,MVD,Paul,TN,IND,121002,A
2,Mathew,123459,20101012,20121013,MVD,Paul,WAS,PHIL,121002,A
3,Matt,12345,20101012,20121013,MVD,Paul,BOS,NYC,121002,A
4,Jacob,1256,20101012,20121013,MVD,Paul,VIC,AU,121002,A

In [9]:
def mandate(input):
    if (input == "Yes"):
        print(data.Customer_Name, data.Customer_ID, data.Customer_Open_Date)
        
    elif input == "No":
          print(data)

In [10]:
mandate("Yes")

0      Alex
1     John
2    Mathew
3      Matt
4     Jacob
Name: Customer_Name, dtype: object 0    123457
1    123458
2    123459
3     12345
4      1256
Name: Customer_ID, dtype: int64 0    20101012
1    20101012
2    20101012
3    20101012
4    20101012
Name: Customer_Open_Date, dtype: int64

In [11]:
mandate("No")

  Customer_Name  Customer_ID  Customer_Open_Date  Last_Consulted_Date  \
0          Alex       123457            20101012             20121013
1         John        123458            20101012             20121013
2        Mathew       123459            20101012             20121013
3          Matt        12345            20101012             20121013
4         Jacob         1256            20101012             20121013

  Vaccination_Type Doctor_Consulted State Country   Postcode FLAG
0              MVD             Paul    SA      USA    121002    A
1              MVD             Paul    TN      IND    121002    A
2              MVD             Paul   WAS     PHIL    121002    A
3              MVD             Paul   BOS     NYC     121002    A
4              MVD             Paul   VIC       AU    121002    A

In [237]:
#df = pd.DataFrame(data, columns= ['Customer_Name','Customer ID','Customer Open Date','Last Consulted Date','Vaccination Type','Doctor Consulted','State','Country','Postcode','DOB','FLAG'])

In [12]:
data.head()

,Customer_Name,Customer_ID,Customer_Open_Date,Last_Consulted_Date,Vaccination_Type,Doctor_Consulted,State,Country,Postcode,FLAG
0,Alex,123457,20101012,20121013,MVD,Paul,SA,USA,121002,A
1,John,123458,20101012,20121013,MVD,Paul,TN,IND,121002,A
2,Mathew,123459,20101012,20121013,MVD,Paul,WAS,PHIL,121002,A
3,Matt,12345,20101012,20121013,MVD,Paul,BOS,NYC,121002,A
4,Jacob,1256,20101012,20121013,MVD,Paul,VIC,AU,121002,A

In [13]:
data.dtypes

Customer_Name          object
Customer_ID             int64
Customer_Open_Date      int64
Last_Consulted_Date     int64
Vaccination_Type       object
Doctor_Consulted       object
State                  object
Country                object
Postcode                int64
FLAG                   object
dtype: object

# Applying SQL Queries

In [80]:
import mysql.connector
from pprint import pprint

In [81]:
db = mysql.connector.connect(host = "localhost", 
                             user = "root",
                            passwd = "qwerty1234",
                            database = "testdb")

In [82]:
mycursor = db.cursor()

CREATING DATABASE

In [83]:
#mycursor = db.cursor()

#mycursor.execute("CREATE DATABASE testdb")

In [93]:
cmd = '''
CREATE TABLE Customer_Data(
Customer_Name VARCHAR(255),
Customer VARCHAR(255),
Customer_Open_Date  DATE,
Last_Consulted_Date DATE,
Vaccination_Type CHAR(5),
Doctor_Consulted CHAR(255),
State CHAR(5),
Country CHAR(5),
Postcode INTEGER,
FLAG CHAR(1)
);
'''
mycursor.execute(cmd)

In [94]:
for i,row in data.iterrows():
    sql = "INSERT INTO testdb.Customer_Data VALUES (%s,%s,%s,%s,%s,%s,%s,%s,%s,%s)"
    mycursor.execute(sql, tuple(row))
    db.commit()

Checking if Database Running successfully

In [95]:
cmd = "SELECT * FROM Customer_Data"
mycursor.execute(cmd)

result = mycursor.fetchall()
for i in result:
    print(i)

('Alex', '123457', datetime.date(2010, 10, 12), datetime.date(2012, 10, 13), 'MVD', 'Paul', 'SA', 'USA', 121002, 'A')
('John ', '123458', datetime.date(2010, 10, 12), datetime.date(2012, 10, 13), 'MVD', 'Paul', 'TN', 'IND', 121002, 'A')
('Mathew', '123459', datetime.date(2010, 10, 12), datetime.date(2012, 10, 13), 'MVD', 'Paul', 'WAS', 'PHIL', 121002, 'A')
('Matt', '12345', datetime.date(2010, 10, 12), datetime.date(2012, 10, 13), 'MVD', 'Paul', 'BOS', 'NYC', 121002, 'A')
('Jacob', '1256', datetime.date(2010, 10, 12), datetime.date(2012, 10, 13), 'MVD', 'Paul', 'VIC', 'AU', 121002, 'A')

Fetching the country base data

In [96]:
cmd = '''
SELECT Customer_Name, Customer, Customer_Open_Date, Last_Consulted_Date, Vaccination_Type, Doctor_Consulted, State, Country, Postcode, FLAG 

FROM Customer_Data

WHERE Country = "USA"

;
'''
mycursor.execute(cmd)
answer1 = mycursor.fetchall()
answer1 = pd.DataFrame(answer1, columns= ['Customer_Name','Customer','Customer_Open_Date','Last_Consulted_Date','Vaccination_Type','Doctor_Consulted','State','Country','Postcode','FLAG'])
answer1

,Customer_Name,Customer,Customer_Open_Date,Last_Consulted_Date,Vaccination_Type,Doctor_Consulted,State,Country,Postcode,FLAG
0,Alex,123457,2010-10-12,2012-10-13,MVD,Paul,SA,USA,121002,A

In [97]:
def Country_Name(Country):
    cmd = ''' select * from Customer_Data where Country = "USA";'''
    mycursor.execute(cmd)
    ans = mycursor.fetchall()
    return ans

In [98]:
Country_Name("USA")

[('Alex',
  '123457',
  datetime.date(2010, 10, 12),
  datetime.date(2012, 10, 13),
  'MVD',
  'Paul',
  'SA',
  'USA',
  121002,
  'A')]